#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

mongodbatlas_project.atlas-project: Refreshing state... [id=65b2a438d647a86dc0a6c298]
mongodbatlas_project_ip_access_list.ip: Refreshing state... [id=ZW50cnk=:MC4wLjAuMC8w-cHJvamVjdF9pZA==:NjViMmE0MzhkNjQ3YTg2ZGMwYTZjMjk4]
mongodbatlas_database_user.db-user: Refreshing state... [id=YXV0aF9kYXRhYmFzZV9uYW1l:YWRtaW4=-cHJvamVjdF9pZA==:NjViMmE0MzhkNjQ3YTg2ZGMwYTZjMjk4-dXNlcm5hbWU=:ZGJfcGVkaWRvX3VzZXI=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # mongodbatlas_advanced_cluster.atlas-cluster will be created
  + resource "mongodbatlas_advanced_cluster" "atlas-cluster" {
      + advanced_configuration         = (known after apply)
      + backup_enabled                 = (known after apply)
      + cluster_id                     = (known after apply)
      + cluster_type                   = "REPLICASET"
      + connection_strings             = (known after apply)
      + create_date                    = (known after apply)
      + disk_size_gb                   = (known after apply)
      + encryption_at_rest_provider    = (known after apply)
      + id                             = (known after apply)
      + mongo_db_major_version         = (known after apply)
      + mongo_db_version               = (known after apply)
      + name                           = "tc-pedidos-cluster"
      + paused                         = (known after apply)
      + pit_enabled                    = (known after apply)
      + project_id                     = "65b2a438d647a86dc0a6c298"
      + root_cert_type                 = (known after apply)
      + state_name                     = (known after apply)
      + termination_protection_enabled = (known after apply)
      + version_release_system         = (known after apply)

      + replication_specs {
          + container_id = (known after apply)
          + id           = (known after apply)
          + num_shards   = 1
          + zone_name    = "ZoneName managed by Terraform"

          + region_configs {
              + backing_provider_name = "AWS"
              + priority              = 7
              + provider_name         = "TENANT"
              + region_name           = "US_EAST_1"

              + electable_specs {
                  + disk_iops     = (known after apply)
                  + instance_size = "M0"
                  + node_count    = 1
                }
            }
        }
    }

  # mongodbatlas_project.atlas-project will be updated in-place
  ~ resource "mongodbatlas_project" "atlas-project" {
        id                                               = "65b2a438d647a86dc0a6c298"
      ~ name                                             = "tech-challenge-pedidos" -> "tc-pedidos"
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + atlas_cluster_connection_string = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @daniel-eiro, Action: `pull_request`*